{
  "backend/main.mo": "Defines data models and access‑controlled actor methods for vehicle inspections, detailed inspection records, user profiles, and related storage maps.",
  "feature_evidence.json": "Lists feature evidence entries linking camera-related requirements to specific frontend files and components.",
  "frontend-file-summaries.txt": "Provides brief descriptions of key frontend files and their roles in the inspection workflow and UI.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, icons, and loading the React bundle.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and startup configuration.",
  "frontend/public/sw.js": "Simple service worker enabling basic PWA caching with passthrough fetch behavior.",
  "frontend/src/App.tsx": "Main React app managing authentication, page routing, and layout with header, footer, and theming.",
  "frontend/src/components/camera/CameraDiagnostics.tsx": "Displays expandable camera diagnostics showing API availability and last camera error details.",
  "frontend/src/components/Footer.tsx": "Footer component showing attribution and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Renders the app header with user menu, logout handling, navigation, and PWA install logic based on authentication state.",
  "frontend/src/components/preInspection/AccessoriesSection.tsx": "Manages editable lists of electrical and non-electrical accessories with add, update, and remove functionality.",
  "frontend/src/components/preInspection/GlassStatusTable.tsx": "Provides a table to edit glass status entries, toggle safety/broken states, and add default glass items.",
  "frontend/src/components/preInspection/PartsChecklistTable.tsx": "Renders a parts checklist table allowing status selection, remarks entry, and adding default parts.",
  "frontend/src/components/preInspection/YesNoField.tsx": "Simple yes/no radio field component with a label and boolean state callback.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty file with no implemented component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, identity loading, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/usePwaInstallPrompt.ts": "Custom hook that captures the beforeinstallprompt event and exposes whether the app is installable and a method to trigger the install prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks to call backend actor methods for creating inspections, saving forms, adding photos, and fetching inspection data.",
  "frontend/src/index.css": "Tailwind setup file defining CSS variables for light and dark themes along with base styling overrides.",
  "frontend/src/main.tsx": "App entry point that mounts React, applying QueryClientProvider and InternetIdentityProvider around the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard UI showing shortcuts to start inspections, view reports, install the app, and display user inspection summaries.",
  "frontend/src/pages/InstallHelpPage.tsx": "Displays PWA installation instructions for Android Chrome and clarifies that an APK cannot be generated.",
  "frontend/src/pages/LoginPage.tsx": "Login page that collects a mobile number and triggers Internet Identity login while showing validation and loading states.",
  "frontend/src/pages/PdfPreviewPage.tsx": "Loads inspection data, validates it, and renders a PDF preview with options to generate and download the report. Manages stored photos and prints the formatted HTML content in a new window.",
  "frontend/src/pages/PhotoCapturePage.tsx": "Handles camera access, photo capture with metadata, and location permissions for an inspection. Manages camera readiness, saving photos, and navigation between steps.",
  "frontend/src/pages/PreInspectionFormPage.tsx": "Loads and edits pre‑inspection form data including checklists, accessories, and declarations. Saves the form and proceeds to the photo capture step.",
  "frontend/src/pages/RemarksPage.tsx": "Collects and saves inspection remarks with character counting and navigation to the PDF preview. Allows skipping or submitting remarks.",
  "frontend/src/pages/ReportsPage.tsx": "Displays the user's list of inspection reports with loading and error states. Allows navigating to the PDF preview for a selected report.",
  "frontend/src/pages/VehicleDetailsPage.tsx": "React form page for entering vehicle and customer details, validating inputs, and creating a detailed inspection before navigating to the next step.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs registration success or failure.",
  "frontend/src/utils/preInspectionSchema.ts": "Exports default parts and glass lists used as baseline items for pre‑inspection checklists.",
  "frontend/src/utils/reportValidation.ts": "Validates a detailed inspection report, returning missing or invalid field errors.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and session parameters for routing and state.",
  "frontend/tailwind.config.js": "TailwindCSS configuration with theme extensions, OKLCH color tokens, animations, and plugins.",
  "project_state.json": "Project metadata describing the app’s architecture, workflow, PWA support, and known issues."
}