{
  "backend/main.mo": "Defines types and state for inspections, detailed inspections, user profiles, and exposes profile query functions with access control.",
  "feature_evidence.json": "Feature evidence file mapping feature IDs to affected frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of each frontend file describing its purpose within the inspection workflow and UI.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main app component controlling authentication, navigation between pages, and global layout.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header component with app title, dashboard navigation, and authenticated user menu with logout.",
  "frontend/src/components/preInspection/AccessoriesSection.tsx": "Manages add/update/remove UI for electrical and non‑electrical accessories using tabbed inputs.",
  "frontend/src/components/preInspection/GlassStatusTable.tsx": "Provides a table to edit glass status entries, including safe/broken toggles and default glass insertion.",
  "frontend/src/components/preInspection/PartsChecklistTable.tsx": "Renders a parts checklist table allowing status selection, remarks editing, and loading default parts.",
  "frontend/src/components/preInspection/YesNoField.tsx": "Simple reusable radio field for selecting a boolean yes/no value.",
  "frontend/src/components/ProfileSetupModal.tsx": "Empty or incomplete file with no implementation content.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an auth provider and hook for managing Internet Identity login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines react‑query hooks for creating inspections, saving pre‑inspection data, adding photos, and fetching inspection details.",
  "frontend/src/index.css": "Sets up Tailwind layers and defines extensive CSS variables for light and dark themes. Applies global border, background, and text styles.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity provider. Loads global styles and renders the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "Displays dashboard cards for starting inspections and viewing reports, and lists recent inspection records. Fetches user inspections and handles loading states.",
  "frontend/src/pages/LoginPage.tsx": "Provides a mobile-number login form using Internet Identity and validates input before triggering authentication. Shows loading state and error toasts.",
  "frontend/src/pages/PdfPreviewPage.tsx": "Loads inspection data, validates it, previews a report, and allows generating or downloading a PDF via a print window. Loads photos and shows validation alerts.",
  "frontend/src/pages/PhotoCapturePage.tsx": "Handles camera access, video readiness, GPS permission, and capturing photos with metadata for an inspection. Manages camera lifecycle and error states.",
  "frontend/src/pages/PreInspectionFormPage.tsx": "Displays and saves a multi-section pre‑inspection form populated from inspection data. Validates presence of inspection ID and navigates to photo capture after saving.",
  "frontend/src/pages/RemarksPage.tsx": "Provides a remarks form for an inspection, saving notes and navigating to preview while validating input.",
  "frontend/src/pages/ReportsPage.tsx": "Displays a list of user inspections with loading/error states and allows navigating to individual report previews.",
  "frontend/src/pages/VehicleDetailsPage.tsx": "Collects and validates vehicle and customer details, creates a detailed inspection, and navigates to the next form.",
  "frontend/src/utils/preInspectionSchema.ts": "Exports default lists of vehicle parts and glass items used for pre‑inspection checklists.",
  "frontend/src/utils/reportValidation.ts": "Validates a detailed inspection object, returning missing or invalid fields as error messages.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, storing, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s current state and version plus a list of existing features, each describing authentication, actor creation, access control, inspection creation, photo capture, and metadata submission capabilities."
}