{
  "kind": "build_request",
  "title": "Fix camera capture option in PhotoCapturePage",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose and fix the camera start/preview/capture flow used by `frontend/src/pages/PhotoCapturePage.tsx` so that the device camera reliably starts and the preview becomes ready, allowing users to capture photos on supported mobile and desktop browsers.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "CAMERA OPTION NOT WORKING"
        ]
      },
      "acceptanceCriteria": [
        "On a device/browser that supports `getUserMedia`, tapping “Start Camera” shows a live preview within 5 seconds and enables the “Capture Photo” button.",
        "Tapping “Capture Photo” adds a new thumbnail to the captured photos grid and shows the success toast.",
        "If camera access is denied, a clear English error message is shown and “Try Again” re-prompts/recovers after the user changes permissions.",
        "If no camera is available or the browser is unsupported, the page shows the existing user-friendly fallback states (not supported / not found) without crashing.",
        "Leaving the Photo Capture page stops the camera stream and releases the device camera indicator."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the `useCamera` hook import used by `PhotoCapturePage` resolves correctly in production builds and that camera-related runtime errors are surfaced with actionable messages (permission denied, not found, not supported, unknown).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "CAMERA OPTION NOT WORKING"
        ]
      },
      "acceptanceCriteria": [
        "The `useCamera` hook file exists at the import path used by `PhotoCapturePage` (`../camera/useCamera`) and is included in the build output.",
        "If the hook fails to initialize due to missing APIs (e.g., `navigator.mediaDevices`), `PhotoCapturePage` enters the “Camera Not Supported” UI state rather than throwing an uncaught exception.",
        "Error types returned by the hook map to the existing `getErrorMessage()` cases in `PhotoCapturePage` (permission, not-found, not-supported, unknown)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a lightweight in-app diagnostics view on the Photo Capture page (shown only when camera initialization fails) that displays key capability checks (HTTPS/secure context, `navigator.mediaDevices` availability, detected devices count if accessible, and last error message) to speed up field troubleshooting.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "CAMERA OPTION NOT WORKING"
        ]
      },
      "acceptanceCriteria": [
        "When the camera is in an error state, the UI includes a collapsible “Diagnostics” section with the capability checks and last error text in English.",
        "The diagnostics view does not display when the camera is working normally.",
        "No sensitive data (identities/tokens) is displayed in diagnostics."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not modify any files under `frontend/src/components/ui` (compose existing Shadcn components instead).",
    "Respect the existing single-page state navigation pattern in `frontend/src/App.tsx` (no new routing framework)."
  ],
  "nonGoals": [
    "Implementing backend image-byte uploads or server-side photo storage (current design stores only metadata in Motoko).",
    "Adding third-party camera libraries or native mobile packaging (APK).",
    "Changing the inspection workflow steps beyond making camera capture functional and diagnosable."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}