{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Repair PhotoCapturePage camera flow, hook resolution, and add error diagnostics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix the PhotoCapturePage camera start/preview/capture lifecycle so the preview reliably becomes ready, capture works, and the stream is released on page exit.",
      "acceptanceCriteria": [
        "On a device/browser that supports `getUserMedia`, tapping “Start Camera” shows a live preview within 5 seconds and enables the “Capture Photo” button.",
        "Tapping “Capture Photo” adds a new thumbnail to the captured photos grid and shows the success toast.",
        "If camera access is denied, a clear English error message is shown and “Try Again” re-prompts/recovers after the user changes permissions.",
        "If no camera is available or the browser is unsupported, the page shows the existing user-friendly fallback states (not supported / not found) without crashing.",
        "Leaving the Photo Capture page stops the camera stream and releases the device camera indicator."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PhotoCapturePage.tsx",
          "operation": "modify",
          "description": "Harden the start/stop/preview-ready/capture flow: ensure Start Camera triggers a reliable preview readiness signal (event-driven with a safe fallback timeout that doesn’t depend on stale state), only enable Capture when the preview is truly ready, keep the preview layout from collapsing (explicit non-zero dimensions/aspect), and ensure unmount cleanup always stops the stream (fire-and-forget Promise safe in effect cleanup). Use the selected \"camera\" hook via the local wrapper import and follow the component guidance to keep buttons disabled until fully initialized. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the useCamera import path resolves in production and normalize/handle camera runtime error types so PhotoCapturePage shows actionable, mapped error states instead of uncaught exceptions.",
      "acceptanceCriteria": [
        "The `useCamera` hook file exists at the import path used by `PhotoCapturePage` (`../camera/useCamera`) and is included in the build output.",
        "If the hook fails to initialize due to missing APIs (e.g., `navigator.mediaDevices`), `PhotoCapturePage` enters the “Camera Not Supported” UI state rather than throwing an uncaught exception.",
        "Error types returned by the hook map to the existing `getErrorMessage()` cases in `PhotoCapturePage` (permission, not-found, not-supported, unknown)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/camera/useCamera.ts",
          "operation": "create",
          "description": "Create a stable wrapper hook at the exact relative import location used by PhotoCapturePage. Re-export and/or wrap the selected \"camera\" component’s `useCamera` (sourced from the component module) so the path resolves in production builds, add defensive capability checks for missing browser APIs (return isSupported=false + not-supported error rather than throwing), and normalize any error types (e.g., timeout) into the set expected by PhotoCapturePage (permission / not-found / not-supported / unknown). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PhotoCapturePage.tsx",
          "operation": "modify",
          "description": "Align PhotoCapturePage error-state handling with the wrapper hook’s normalized error types; ensure unsupported/missing API scenarios render the existing 'Camera Not Supported' fallback without uncaught exceptions, and surface actionable English error text for permission denied / not found / not supported / unknown. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add an in-app Diagnostics view on PhotoCapturePage that appears only when camera initialization fails, showing capability checks and last error text for troubleshooting.",
      "acceptanceCriteria": [
        "When the camera is in an error state, the UI includes a collapsible “Diagnostics” section with the capability checks and last error text in English.",
        "The diagnostics view does not display when the camera is working normally.",
        "No sensitive data (identities/tokens) is displayed in diagnostics."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/camera/CameraDiagnostics.tsx",
          "operation": "create",
          "description": "Implement a lightweight diagnostics component (collapsible via native `details/summary` or existing composition of shadcn components without modifying `frontend/src/components/ui`). Show only non-sensitive checks: secure context/HTTPS status, `navigator.mediaDevices` availability, best-effort camera device count (if accessible), and the last camera error message/type in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/PhotoCapturePage.tsx",
          "operation": "modify",
          "description": "Wire the Diagnostics component into the existing error UI so it appears only when camera initialization fails (e.g., when `error` is present), and remains hidden during normal operation. Ensure no identities/tokens are passed through or displayed. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}